# Lesson 04 Task: SQL Basics (Track A)

## Database Applications Development

---

## Instructions

Complete all exercises below. Write SQL queries to answer each question.

**Resources:**
- Keep `SQL_Reference_Guide.md` open
- Review `dbApps04_Walkthrough.ipynb` for examples
- Ask for help if stuck!

**Submission:**
- Complete all TODO sections
- Test that all your queries run without errors
- Push to GitHub: `databaseApplications/dbApps04_Task_TrackA.ipynb`

Let's practice SQL! ðŸš€

---

## Setup

In [24]:
import pandas as pd
import sqlite3

# Connect to database
conn = sqlite3.connect('titanic.db')
print("âœ… Connected to database")

âœ… Connected to database

---

## Part 1: SELECT Basics (5 queries)

Practice selecting specific columns.

### Query 1: Select All Columns

**Task:** Write a query to select ALL columns from the passengers table. Limit to 5 rows.

In [25]:
# TODO: Write your query here
query_1 = """
SELECT *
FROM passengers
LIMIT 5
"""

result_1 = pd.read_sql(query_1, conn)
display(result_1)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"

### Query 2: Select Name and Age

**Task:** Select only the Name and Age columns. Show first 10 rows.

In [26]:
# TODO: Write your query
query_2 = """
SELECT Name, Age
FROM passengers
LIMIT 10
"""

result_2 = pd.read_sql(query_2, conn)
display(result_2)

                                              name    age
0                    Allen, Miss. Elisabeth Walton  29.00
1                   Allison, Master. Hudson Trevor   0.92
2                     Allison, Miss. Helen Loraine   2.00
3             Allison, Mr. Hudson Joshua Creighton  30.00
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00
5                              Anderson, Mr. Harry  48.00
6                Andrews, Miss. Kornelia Theodosia  63.00
7                           Andrews, Mr. Thomas Jr  39.00
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00
9                          Artagaveytia, Mr. Ramon  71.00

### Query 3: Select Multiple Columns

**Task:** Select Name, Age, Sex, and Survived columns. Show first 10 rows.

In [27]:
# TODO: Write your query
query_3 = """
SELECT Name, Age, Sex, Survived
FROM passengers
LIMIT 10
"""

result_3 = pd.read_sql(query_3, conn)
display(result_3)

                                              name    age     sex  survived
0                    Allen, Miss. Elisabeth Walton  29.00  female         1
1                   Allison, Master. Hudson Trevor   0.92    male         1
2                     Allison, Miss. Helen Loraine   2.00  female         0
3             Allison, Mr. Hudson Joshua Creighton  30.00    male         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00  female         0
5                              Anderson, Mr. Harry  48.00    male         1
6                Andrews, Miss. Kornelia Theodosia  63.00  female         1
7                           Andrews, Mr. Thomas Jr  39.00    male         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00  female         1
9                          Artagaveytia, Mr. Ramon  71.00    male         0

### Query 4: Select Name, Pclass, and Fare

**Task:** Select Name, Pclass, and Fare columns. Show first 10 rows.

In [28]:
# TODO: Write your query
query_4 = """
SELECT Name, Pclass, Fare
FROM passengers
LIMIT 10
"""

result_4 = pd.read_sql(query_4, conn)
display(result_4)

                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
1                   Allison, Master. Hudson Trevor       1  151.5500
2                     Allison, Miss. Helen Loraine       1  151.5500
3             Allison, Mr. Hudson Joshua Creighton       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
5                              Anderson, Mr. Harry       1   26.5500
6                Andrews, Miss. Kornelia Theodosia       1   77.9583
7                           Andrews, Mr. Thomas Jr       1    0.0000
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792
9                          Artagaveytia, Mr. Ramon       1   49.5042

### Query 5: Your Choice!

**Task:** Select ANY 3 columns you want. Show 10 rows. Explain your choice below.

In [29]:
# TODO: Write your query
query_5 = """
SELECT Ticket, Cabin, Embarked
FROM passengers
LIMIT 10
"""

result_5 = pd.read_sql(query_5, conn)
display(result_5)

     ticket    cabin embarked
0     24160       B5        S
1    113781  C22 C26        S
2    113781  C22 C26        S
3    113781  C22 C26        S
4    113781  C22 C26        S
5     19952      E12        S
6     13502       D7        S
7    112050      A36        S
8     11769     C101        S
9  PC 17609     None        C

**Why I chose these columns:** (write your answer here)
I chose those because they weren't in any other Query (excluding the "All" Query)

---

## Part 2: WHERE Clause - Filtering (6 queries)

Practice filtering rows with conditions.

### Query 6: Passengers Over Age 30

**Task:** Find all passengers older than 30. Show Name and Age.

In [30]:
# TODO: Write your query
query_6 = """
SELECT Name, Age
FROM passengers
WHERE Age > 30
"""

result_6 = pd.read_sql(query_6, conn)
print(f"Found {len(result_6)} passengers over 30")
display(result_6.head(10))

Found 437 passengers over 30

                                              name   age
0                              Anderson, Mr. Harry  48.0
1                Andrews, Miss. Kornelia Theodosia  63.0
2                           Andrews, Mr. Thomas Jr  39.0
3    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0
4                          Artagaveytia, Mr. Ramon  71.0
5                           Astor, Col. John Jacob  47.0
6             Barkworth, Mr. Algernon Henry Wilson  80.0
7  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0
8                            Bazzani, Miss. Albina  32.0
9                             Beattie, Mr. Thomson  36.0

### Query 7: Female Passengers

**Task:** Find all female passengers. Show Name, Age, and Sex. Limit to 10 rows.

In [31]:
# TODO: Write your query (remember: text needs single quotes!)
query_7 = """
SELECT Name, Age, Sex
FROM passengers
WHERE Sex = 'female'
"""

result_7 = pd.read_sql(query_7, conn)
display(result_7)

                                                name   age     sex
0                      Allen, Miss. Elisabeth Walton  29.0  female
1                       Allison, Miss. Helen Loraine   2.0  female
2    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.0  female
3                  Andrews, Miss. Kornelia Theodosia  63.0  female
4      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0  female
..                                               ...   ...     ...
461  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)  38.0  female
462                 Wilkes, Mrs. James (Ellen Needs)  47.0  female
463          Yasbeck, Mrs. Antoni (Selini Alexander)  15.0  female
464                             Zabour, Miss. Hileni  14.5  female
465                            Zabour, Miss. Thamine   NaN  female

[466 rows x 3 columns]

### Query 8: First Class Passengers

**Task:** Find all first class passengers (Pclass = 1). Show Name, Pclass, and Fare. Limit to 10.

In [32]:
# TODO: Write your query
query_8 = """
SELECT Name, Pclass, Fare
FROM passengers
WHERE Pclass = 1
LIMIT 10
"""

result_8 = pd.read_sql(query_8, conn)
display(result_8)

                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
1                   Allison, Master. Hudson Trevor       1  151.5500
2                     Allison, Miss. Helen Loraine       1  151.5500
3             Allison, Mr. Hudson Joshua Creighton       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
5                              Anderson, Mr. Harry       1   26.5500
6                Andrews, Miss. Kornelia Theodosia       1   77.9583
7                           Andrews, Mr. Thomas Jr       1    0.0000
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792
9                          Artagaveytia, Mr. Ramon       1   49.5042

### Query 9: Survivors

**Task:** Find all passengers who survived (Survived = 1). Show Name, Age, Sex, and Survived. Limit to 15.

In [33]:
# TODO: Write your query
query_9 = """
SELECT Name, Age, Sex, Survived
FROM passengers
WHERE Survived = 1
"""

result_9 = pd.read_sql(query_9, conn)
display(result_9)

                                                name    age     sex  survived
0                      Allen, Miss. Elisabeth Walton  29.00  female         1
1                     Allison, Master. Hudson Trevor   0.92    male         1
2                                Anderson, Mr. Harry  48.00    male         1
3                  Andrews, Miss. Kornelia Theodosia  63.00  female         1
4      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00  female         1
..                                               ...    ...     ...       ...
495                           Turkula, Mrs. (Hedwig)  63.00  female         1
496                             Vartanian, Mr. David  22.00    male         1
497  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)  38.00  female         1
498                 Wilkes, Mrs. James (Ellen Needs)  47.00  female         1
499          Yasbeck, Mrs. Antoni (Selini Alexander)  15.00  female         1

[500 rows x 4 columns]

### Query 10: Passengers Who Paid High Fares

**Task:** Find passengers who paid more than $50. Show Name, Fare, and Pclass. Limit to 10.

In [34]:
# TODO: Write your query
query_10 = """
SELECT Name, Pclass, Fare
FROM passengers
WHERE Fare > 50
LIMIT 10
"""

result_10 = pd.read_sql(query_10, conn)
display(result_10)

                                                name  pclass      fare
0                      Allen, Miss. Elisabeth Walton       1  211.3375
1                     Allison, Master. Hudson Trevor       1  151.5500
2                       Allison, Miss. Helen Loraine       1  151.5500
3               Allison, Mr. Hudson Joshua Creighton       1  151.5500
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
5                  Andrews, Miss. Kornelia Theodosia       1   77.9583
6      Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792
7                             Astor, Col. John Jacob       1  227.5250
8  Astor, Mrs. John Jacob (Madeleine Talmadge Force)       1  227.5250
9                      Aubart, Mme. Leontine Pauline       1   69.3000

### Query 11: Children (Age 12 or Under)

**Task:** Find children age 12 or under. Show Name and Age. Limit to 10.

In [35]:
# TODO: Write your query
query_11 = """
SELECT Name, Age
FROM passengers
WHERE Age < 13
"""

result_11 = pd.read_sql(query_11, conn)
display(result_11)

                                   name    age
0        Allison, Master. Hudson Trevor   0.92
1          Allison, Miss. Helen Loraine   2.00
2   Carter, Master. William Thornton II  11.00
3             Dodge, Master. Washington   4.00
4       Spedden, Master. Robert Douglas   6.00
..                                  ...    ...
89      Thomas, Master. Assad Alexander   0.42
90       Touma, Master. Georges Youssef   7.00
91           Touma, Miss. Maria Youssef   9.00
92    van Billiard, Master. Walter John  11.50
93            Van Impe, Miss. Catharina  10.00

[94 rows x 2 columns]

---

## Part 3: Multiple Conditions with AND (3 queries)

### Query 12: Female Survivors

**Task:** Find female passengers who survived. Show Name, Age, Sex, and Survived. Limit to 10.

In [44]:
# TODO: Write your query (use AND)
query_12 = """
SELECT Name, Age, Sex, Survived
FROM passengers
WHERE Survived = 1 AND Sex = 'female'
LIMIT 10
"""

result_12 = pd.read_sql(query_12, conn)
display(result_12)

                                                name   age     sex  survived
0                      Allen, Miss. Elisabeth Walton  29.0  female         1
1                  Andrews, Miss. Kornelia Theodosia  63.0  female         1
2      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0  female         1
3  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0  female         1
4                      Aubart, Mme. Leontine Pauline  24.0  female         1
5                       Barber, Miss. Ellen "Nellie"  26.0  female         1
6    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0  female         1
7                              Bazzani, Miss. Albina  32.0  female         1
8   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0  female         1
9                              Bidois, Miss. Rosalie  42.0  female         1

### Query 13: Young Adults (Ages 18-30)

**Task:** Find passengers between age 18 and 30 (inclusive). Show Name and Age. Limit to 15.

**Hint:** You need TWO conditions with AND: `Age >= 18 AND Age <= 30`

In [45]:
# TODO: Write your query
query_13 = """
SELECT Name, Age
FROM passengers
WHERE Age >= 18 AND Age <= 30
LIMIT 15
"""

result_13 = pd.read_sql(query_13, conn)
display(result_13)

                                                 name   age
0                       Allen, Miss. Elisabeth Walton  29.0
1                Allison, Mr. Hudson Joshua Creighton  30.0
2     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.0
3   Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0
4                       Aubart, Mme. Leontine Pauline  24.0
5                        Barber, Miss. Ellen "Nellie"  26.0
6                            Baxter, Mr. Quigg Edmond  24.0
7                               Behr, Mr. Karl Howell  26.0
8                                   Bird, Miss. Ellen  29.0
9                                 Birnbaum, Mr. Jakob  25.0
10                            Bishop, Mr. Dickinson H  25.0
11            Bishop, Mrs. Dickinson H (Helen Walton)  19.0
12          Bjornstrom-Steffansson, Mr. Mauritz Hakan  28.0
13                            Bonnell, Miss. Caroline  30.0
14                        Bowerman, Miss. Elsie Edith  22.0

### Query 14: Male First Class Survivors

**Task:** Find male passengers in first class who survived. Show Name, Age, Sex, Pclass, Survived. Limit to 10.

**Hint:** THREE conditions with AND!

In [47]:
# TODO: Write your query
query_14 = """
SELECT Name, Age, Sex, Pclass, Survived
FROM passengers
WHERE Sex = 'male' AND Pclass = 1 AND Survived = 1
LIMIT 10
"""

result_14 = pd.read_sql(query_14, conn)
display(result_14)

,name,age,sex,pclass,survived
0,"Allison, Master. Hudson Trevor",0.92,male,1,1
1,"Anderson, Mr. Harry",48.00,male,1,1
2,"Barkworth, Mr. Algernon Henry Wilson",80.00,male,1,1
3,"Beckwith, Mr. Richard Leonard",37.00,male,1,1
4,"Behr, Mr. Karl Howell",26.00,male,1,1
5,"Bishop, Mr. Dickinson H",25.00,male,1,1
6,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",28.00,male,1,1
7,"Blank, Mr. Henry",40.00,male,1,1
8,"Bradley, Mr. George (""George Arthur Brayton"")",NaN,male,1,1
9,"Calderhead, Mr. Edward Pennington",42.00,male,1,1

---

## Part 4: ORDER BY - Sorting (4 queries)

### Query 15: Sort by Age (Youngest First)

**Task:** Show Name and Age, sorted by age from youngest to oldest. Limit to 10.

In [48]:
# TODO: Write your query
query_15 = """
SELECT Name, Age
FROM passengers
WHERE Age IS NOT NULL
ORDER BY Age
LIMIT 10
"""

result_15 = pd.read_sql(query_15, conn)
display(result_15)

                                      name   age
0  Dean, Miss. Elizabeth Gladys "Millvina"  0.17
1  Danbom, Master. Gilbert Sigvard Emanuel  0.33
2          Thomas, Master. Assad Alexander  0.42
3                Hamalainen, Master. Viljo  0.67
4                   Baclini, Miss. Eugenie  0.75
5            Baclini, Miss. Helene Barbara  0.75
6           Peacock, Master. Alfred Edward  0.75
7            Caldwell, Master. Alden Gates  0.83
8          Richards, Master. George Sibley  0.83
9                Aks, Master. Philip Frank  0.83

### Query 16: Sort by Age (Oldest First)

**Task:** Show Name and Age, sorted by age from oldest to youngest. Limit to 10.

**Hint:** Use DESC!

In [49]:
# TODO: Write your query
query_16 = """
SELECT Name, Age
FROM passengers
WHERE Age IS NOT NULL
ORDER BY Age DESC
LIMIT 10
"""

result_16 = pd.read_sql(query_16, conn)
display(result_16)

                                                name   age
0               Barkworth, Mr. Algernon Henry Wilson  80.0
1  Cavendish, Mrs. Tyrell William (Julia Florence...  76.0
2                                Svensson, Mr. Johan  74.0
3                            Artagaveytia, Mr. Ramon  71.0
4                          Goldschmidt, Mr. George B  71.0
5                               Connors, Mr. Patrick  70.5
6                       Crosby, Capt. Edward Gifford  70.0
7                        Mitchell, Mr. Henry Michael  70.0
8                                 Straus, Mr. Isidor  67.0
9                              Wheadon, Mr. Edward H  66.0

### Query 17: Sort by Fare (Highest First)

**Task:** Show Name, Fare, and Pclass, sorted by fare from highest to lowest. Limit to 10.

In [50]:
# TODO: Write your query
query_17 = """
SELECT Name, Fare, Pclass
FROM passengers
WHERE Fare IS NOT NULL
ORDER BY Fare DESC
LIMIT 10
"""

result_17 = pd.read_sql(query_17, conn)
display(result_17)

                                                name      fare  pclass
0                 Cardeza, Mr. Thomas Drake Martinez  512.3292       1
1  Cardeza, Mrs. James Warburton Martinez (Charlo...  512.3292       1
2                             Lesurer, Mr. Gustave J  512.3292       1
3                                   Ward, Miss. Anna  512.3292       1
4                     Fortune, Miss. Alice Elizabeth  263.0000       1
5                         Fortune, Miss. Ethel Flora  263.0000       1
6                         Fortune, Miss. Mabel Helen  263.0000       1
7                     Fortune, Mr. Charles Alexander  263.0000       1
8                                  Fortune, Mr. Mark  263.0000       1
9                Fortune, Mrs. Mark (Mary McDougald)  263.0000       1

### Query 18: Sort by Name (Alphabetical)

**Task:** Show Name, Age, and Sex, sorted alphabetically by name. Limit to 15.

In [51]:
# TODO: Write your query
query_18 = """
SELECT Name, Age, Sex
FROM passengers
WHERE Name IS NOT NULL
ORDER BY Name
LIMIT 15
"""

result_18 = pd.read_sql(query_18, conn)
display(result_18)

                                              name    age     sex
0                              Abbing, Mr. Anthony  42.00    male
1                    Abbott, Master. Eugene Joseph  13.00    male
2                      Abbott, Mr. Rossmore Edward  16.00    male
3                 Abbott, Mrs. Stanton (Rosa Hunt)  35.00  female
4                      Abelseth, Miss. Karen Marie  16.00  female
5                    Abelseth, Mr. Olaus Jorgensen  25.00    male
6                              Abelson, Mr. Samuel  30.00    male
7            Abelson, Mrs. Samuel (Hannah Wizosky)  28.00  female
8         Abrahamsson, Mr. Abraham August Johannes  20.00    male
9        Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.00  female
10                  Adahl, Mr. Mauritz Nils Martin  30.00    male
11                                 Adams, Mr. John  26.00    male
12  Ahlin, Mrs. Johan (Johanna Persdotter Larsson)  40.00  female
13                       Aks, Master. Philip Frank   0.83    male
14                      Aks, Mrs. Sam (Leah Rosen)  18.00  female

---

## Part 5: Combined Queries (3 challenges)

Put it all together: SELECT, WHERE, ORDER BY, LIMIT

### Query 19: Young Female Survivors

**Task:** Find female passengers under age 20 who survived. Show Name, Age, Sex, Survived. Sort by age (youngest first). Limit to 10.

In [54]:
# TODO: Write your query
query_19 = """
SELECT Name, Age, Sex, Survived
FROM passengers
WHERE Age <= 20 AND Survived = 1 AND Sex = 'female'
LIMIT 10
"""

result_19 = pd.read_sql(query_19, conn)
display(result_19)

                                                name   age     sex  survived
0  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0  female         1
1            Bishop, Mrs. Dickinson H (Helen Walton)  19.0  female         1
2                          Carter, Miss. Lucile Polk  14.0  female         1
3          Dick, Mrs. Albert Adrian (Vera Gillespie)  17.0  female         1
4                       Graham, Miss. Margaret Edith  19.0  female         1
5                       Hippach, Miss. Jean Gertrude  16.0  female         1
6                          Lines, Miss. Mary Conover  16.0  female         1
7                  Madill, Miss. Georgette Alexandra  15.0  female         1
8                              Maioni, Miss. Roberta  16.0  female         1
9  Marvin, Mrs. Daniel Warner (Mary Graham Carmic...  18.0  female         1

### Query 20: Wealthy First Class Passengers

**Task:** Find first class passengers who paid more than $100. Show Name, Pclass, Fare. Sort by fare (highest first). Limit to 10.

In [52]:
# TODO: Write your query
query_20 = """
SELECT Name, Fare, Pclass
FROM passengers
WHERE Fare >= 100
ORDER BY Fare DESC
LIMIT 10
"""

result_20 = pd.read_sql(query_20, conn)
display(result_20)

                                                name      fare  pclass
0                 Cardeza, Mr. Thomas Drake Martinez  512.3292       1
1  Cardeza, Mrs. James Warburton Martinez (Charlo...  512.3292       1
2                             Lesurer, Mr. Gustave J  512.3292       1
3                                   Ward, Miss. Anna  512.3292       1
4                     Fortune, Miss. Alice Elizabeth  263.0000       1
5                         Fortune, Miss. Ethel Flora  263.0000       1
6                         Fortune, Miss. Mabel Helen  263.0000       1
7                     Fortune, Mr. Charles Alexander  263.0000       1
8                                  Fortune, Mr. Mark  263.0000       1
9                Fortune, Mrs. Mark (Mary McDougald)  263.0000       1

### Query 21: Create Your Own Challenge!

**Task:** Write your own query using:
- SELECT (specific columns)
- WHERE (at least 2 conditions with AND)
- ORDER BY
- LIMIT

Describe what you're looking for:

**My query finds:** (describe here)
The Name, Fare, Age, and Cabin ID, sorting cabins alphabetically

In [59]:
# TODO: Write your creative query!
query_21 = """
SELECT Name, Fare, Age, Cabin
FROM passengers
WHERE Cabin IS NOT NULL
ORDER BY Cabin
LIMIT 20
"""

result_21 = pd.read_sql(query_21, conn)
display(result_21)

                                                 name     fare   age cabin
0                                 Ross, Mr. John Hugo  40.1250  36.0   A10
1                       Rosenbaum, Miss. Edith Louise  27.7208  33.0   A11
2                         Clifford, Mr. George Quincy  52.0000   NaN   A14
3   Duff Gordon, Lady. (Lucille Christiana Sutherl...  39.6000  48.0   A16
4                        Dulles, Mr. William Crothers  29.7000  39.0   A18
5                          Smith, Mr. Richard William  26.0000   NaN   A19
6        Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")  56.9292  49.0   A20
7                             Brady, Mr. John Bertram  30.5000  41.0   A21
8                Barkworth, Mr. Algernon Henry Wilson  30.0000  80.0   A23
9                Roebling, Mr. Washington Augustus II  50.4958  31.0   A24
10                Simonius-Blumer, Col. Oberst Alfons  35.5000  56.0   A26
11                           Evans, Miss. Edith Corse  31.6792  36.0   A29
12                                   Blank, Mr. Henry  31.0000  40.0   A31
13                              Rood, Mr. Hugh Roscoe  50.0000   NaN   A32
14                              Dodge, Dr. Washington  81.8583  53.0   A34
15                          Dodge, Master. Washington  81.8583   4.0   A34
16              Dodge, Mrs. Washington (Ruth Vidaver)  81.8583  54.0   A34
17                             Andrews, Mr. Thomas Jr   0.0000  39.0   A36
18                          Goldschmidt, Mr. George B  34.6542  71.0    A5
19                       Sloper, Mr. William Thompson  35.5000  28.0    A6

---

## Reflection Questions

Answer these questions in the markdown cells below:

### Question 1: SQL vs. pandas

**How is writing WHERE in SQL similar to filtering in pandas? How is it different?**

*Your answer here:* It is used to get info that fits into a specific criteria.

### Question 2: ORDER BY

**When would you use ORDER BY ASC vs. ORDER BY DESC? Give a real-world example for each.**

*Your answer here:* ASC is used to count up, like finding something alphabetically, DESC is used to count down, like finding the most of a category like money spent.

### Question 3: Most Challenging

**Which query was hardest for you? Why? How did you figure it out?**

*Your answer here:* WHERE because it had the most specific things in it

---

## Clean Up

In [60]:
# Close database connection
conn.close()
print("âœ… Connection closed. Great work!")

âœ… Connection closed. Great work!

---

## âœ… Before You Submit

Make sure you:
- [ ] Completed all 21 queries
- [ ] Answered all reflection questions
- [ ] Tested that all cells run without errors
- [ ] Used proper SQL syntax (SELECT â†’ FROM â†’ WHERE â†’ ORDER BY â†’ LIMIT)
- [ ] Put single quotes around text values
- [ ] Saved your file

**Submit via GitHub:** `databaseApplications/dbApps04_Task_TrackA.ipynb`

**Great work!** You've learned SQL basics! ðŸŽ‰